Model_O
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
dense (Dense)                (None, 256)               15616     
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024      
_________________________________________________________________
re_lu (ReLU)                 (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                8224      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 25,025
Trainable params: 24,449
Non-trainable params: 576
_________________________________________________________________


Model_C
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 32)                1952      
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              33792     
_________________________________________________________________
re_lu_1 (ReLU)               (None, 1024)              0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 1025      
=================================================================
Total params: 36,890
Trainable params: 36,769
Non-trainable params: 121
_________________________________________________________________


Model_E
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 512)               31232     
_________________________________________________________________
batch_normalization (BatchNo (None, 512)               2048      
_________________________________________________________________
re_lu (ReLU)                 (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 513       
=================================================================
Total params: 33,914
Trainable params: 32,769
Non-trainable params: 1,145
_________________________________________________________________


Model_A
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 16)                976       
_________________________________________________________________
batch_normalization (BatchNo (None, 16)                64        
_________________________________________________________________
re_lu (ReLU)                 (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                544       
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_2 (ReLU)               (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 3,050
Trainable params: 2,769
Non-trainable params: 281
_________________________________________________________________


Model_N
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
dense (Dense)                (None, 1024)              62464     
_________________________________________________________________
re_lu (ReLU)                 (None, 1024)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 1025      
=================================================================
Total params: 63,489
Trainable params: 63,489
Non-trainable params: 0
_________________________________________________________________


