Model_O
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 256)               15616     
_________________________________________________________________
re_lu (ReLU)                 (None, 256)               0         
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
re_lu_1 (ReLU)               (None, 256)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 257       
=================================================================
Total params: 81,786
Trainable params: 81,665
Non-trainable params: 121
_________________________________________________________________


Model_C
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 32)                1952      
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 3,162
Trainable params: 3,041
Non-trainable params: 121
_________________________________________________________________


Model_E
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 512)               31232     
_________________________________________________________________
re_lu (ReLU)                 (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              525312    
_________________________________________________________________
re_lu_1 (ReLU)               (None, 1024)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 1025      
=================================================================
Total params: 557,690
Trainable params: 557,569
Non-trainable params: 121
_________________________________________________________________


Model_A
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 512)               31232     
_________________________________________________________________
re_lu (ReLU)                 (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              525312    
_________________________________________________________________
re_lu_1 (ReLU)               (None, 1024)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 1025      
=================================================================
Total params: 557,690
Trainable params: 557,569
Non-trainable params: 121
_________________________________________________________________


Model_N
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 60)]              0         
_________________________________________________________________
multi_category_encoding (Mul (None, 60)                0         
_________________________________________________________________
normalization (Normalization (None, 60)                121       
_________________________________________________________________
dense (Dense)                (None, 1024)              62464     
_________________________________________________________________
re_lu (ReLU)                 (None, 1024)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                32800     
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              33792     
_________________________________________________________________
re_lu_2 (ReLU)               (None, 1024)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 1024)              0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 1025      
=================================================================
Total params: 130,202
Trainable params: 130,081
Non-trainable params: 121
_________________________________________________________________


