Model_O
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 18,785
Trainable params: 18,785
Non-trainable params: 0
_________________________________________________________________


Model_C
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 128)               70784     
_________________________________________________________________
re_lu (ReLU)                 (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 65        
=================================================================
Total params: 84,370
Trainable params: 83,265
Non-trainable params: 1,105
_________________________________________________________________


Model_E
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 512)               283136    
_________________________________________________________________
batch_normalization (BatchNo (None, 512)               2048      
_________________________________________________________________
re_lu (ReLU)                 (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                16416     
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 302,866
Trainable params: 300,673
Non-trainable params: 2,193
_________________________________________________________________


Model_A
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 512)               283136    
_________________________________________________________________
batch_normalization (BatchNo (None, 512)               2048      
_________________________________________________________________
re_lu (ReLU)                 (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                16416     
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 302,866
Trainable params: 300,673
Non-trainable params: 2,193
_________________________________________________________________


Model_N
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 19,890
Trainable params: 18,785
Non-trainable params: 1,105
_________________________________________________________________


