Model_O
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 19,041
Trainable params: 18,913
Non-trainable params: 128
_________________________________________________________________


Model_C
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
dense (Dense)                (None, 512)               283136    
_________________________________________________________________
batch_normalization (BatchNo (None, 512)               2048      
_________________________________________________________________
re_lu (ReLU)                 (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               65664     
_________________________________________________________________
batch_normalization_1 (Batch (None, 128)               512       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 128)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               33024     
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 256)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 257       
=================================================================
Total params: 385,665
Trainable params: 383,873
Non-trainable params: 1,792
_________________________________________________________________


Model_E
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 18,962
Trainable params: 17,793
Non-trainable params: 1,169
_________________________________________________________________


Model_A
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               16896     
_________________________________________________________________
re_lu_1 (ReLU)               (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 513       
=================================================================
Total params: 35,105
Trainable params: 35,105
Non-trainable params: 0
_________________________________________________________________


Model_N
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 19,890
Trainable params: 18,785
Non-trainable params: 1,105
_________________________________________________________________


