Model_O
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 20,946
Trainable params: 19,841
Non-trainable params: 1,105
_________________________________________________________________


Model_C
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                17696     
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              33792     
_________________________________________________________________
batch_normalization_1 (Batch (None, 1024)              4096      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 1024)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 1025      
=================================================================
Total params: 56,737
Trainable params: 54,625
Non-trainable params: 2,112
_________________________________________________________________


Model_E
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 256)               141568    
_________________________________________________________________
re_lu (ReLU)                 (None, 256)               0         
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 257       
=================================================================
Total params: 142,930
Trainable params: 141,825
Non-trainable params: 1,105
_________________________________________________________________


Model_A
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
normalization (Normalization (None, 552)               1105      
_________________________________________________________________
dense (Dense)                (None, 256)               141568    
_________________________________________________________________
re_lu (ReLU)                 (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                8224      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 151,986
Trainable params: 150,881
Non-trainable params: 1,105
_________________________________________________________________


Model_N
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 552)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 552)               0         
_________________________________________________________________
dense (Dense)                (None, 256)               141568    
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024      
_________________________________________________________________
re_lu (ReLU)                 (None, 256)               0         
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               65792     
_________________________________________________________________
batch_normalization_1 (Batch (None, 256)               1024      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 256)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 257       
=================================================================
Total params: 209,665
Trainable params: 208,641
Non-trainable params: 1,024
_________________________________________________________________


