Model_O
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 512)               284160    
_________________________________________________________________
re_lu (ReLU)                 (None, 512)               0         
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
re_lu_1 (ReLU)               (None, 512)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 513       
=================================================================
Total params: 548,438
Trainable params: 547,329
Non-trainable params: 1,109
_________________________________________________________________


Model_C
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 256)               142080    
_________________________________________________________________
re_lu (ReLU)                 (None, 256)               0         
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 257       
=================================================================
Total params: 143,446
Trainable params: 142,337
Non-trainable params: 1,109
_________________________________________________________________


Model_E
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 64)                35520     
_________________________________________________________________
re_lu (ReLU)                 (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 38,742
Trainable params: 37,633
Non-trainable params: 1,109
_________________________________________________________________


Model_A
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 1024)              568320    
_________________________________________________________________
re_lu (ReLU)                 (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                32800     
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 603,318
Trainable params: 602,209
Non-trainable params: 1,109
_________________________________________________________________


Model_N
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 256)               142080    
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024      
_________________________________________________________________
re_lu (ReLU)                 (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                8224      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 152,598
Trainable params: 150,913
Non-trainable params: 1,685
_________________________________________________________________


