Model_O
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 32)                17760     
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 19,030
Trainable params: 17,857
Non-trainable params: 1,173
_________________________________________________________________


Model_C
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 32)                17760     
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               16896     
_________________________________________________________________
re_lu_1 (ReLU)               (None, 512)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 513       
=================================================================
Total params: 36,278
Trainable params: 35,169
Non-trainable params: 1,109
_________________________________________________________________


Model_E
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 32)                17760     
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 19,958
Trainable params: 18,849
Non-trainable params: 1,109
_________________________________________________________________


Model_A
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
normalization (Normalization (None, 554)               1109      
_________________________________________________________________
dense (Dense)                (None, 64)                35520     
_________________________________________________________________
batch_normalization (BatchNo (None, 64)                256       
_________________________________________________________________
re_lu (ReLU)                 (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               8448      
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 256)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 257       
=================================================================
Total params: 48,822
Trainable params: 47,009
Non-trainable params: 1,813
_________________________________________________________________


Model_N
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 554)]             0         
_________________________________________________________________
multi_category_encoding (Mul (None, 554)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                17760     
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
re_lu (ReLU)                 (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_1 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32)                128       
_________________________________________________________________
re_lu_2 (ReLU)               (None, 32)                0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
regression_head_1 (Dense)    (None, 1)                 33        
=================================================================
Total params: 20,289
Trainable params: 20,097
Non-trainable params: 192
_________________________________________________________________


